//Написать программу, которая выведет на экран все числа от 1 до 100, которые делятся на 3 без остатка
public class Main1 {
    public static void main(String args[]){
        int i;
        for(i = 3; i < 100; i +=3){
            System.out.println(i);
        }
    }
}
